Autodesk.Revit.DB.SunAndShadowSettings.GetActiveSunAndShadowSettings(Autodesk.Revit.DB.Document)
Returns the current SunAndShadowSettings element assigned to the active view for the
supplied document.
aDocument:
The document.
Returns:
The active SunAndShadowSettings element for the supplied document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.IsGroundPlaneLevelValid(Autodesk.Revit.DB.ElementId)
Checks whether the element represents a valid Ground Plane level.
levelId:
Level element id.
Returns:
True if the element is a valid Ground Plane Level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GroundPlaneLevelId
Identifies the element id of the Ground Plane level for the SunAndShadowSettings element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the element level is not a valid Ground Plane Level element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011